## importando a base de dados

# Relatorio de Analise I

In [25]:
import pandas as pd

In [26]:
dados = pd.read_csv('aluguel.csv', sep=';')
dados.head(5)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [27]:
type(dados)

pandas.core.frame.DataFrame

In [28]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

## Informaçoes gerais sobre a base de dados

In [29]:
#tipos de dados das colunas
tipos_de_dados = pd.DataFrame(dados.dtypes, columns=['Tipos Dados']).head(10)

In [30]:
#muda o nome da coluna principal do DF
tipos_de_dados.columns.name = 'Variáveis'

In [31]:
tipos_de_dados

Variáveis  Tipos Dados
Tipo            object
Bairro          object
Quartos          int64
Vagas            int64
Suites           int64
Area             int64
Valor          float64
Condominio     float64
IPTU           float64

In [32]:
#(numero_linha, numero_colunas)
dados.shape

(32960, 9)

In [33]:
print(f'A base de dados apresenta {dados.shape[0]} (imóveis) registros e {dados.shape[1]} variáveis')

A base de dados apresenta 32960 (imóveis) registros e 9 variáveis